Repository: water2004/md-cpp
Catalog: src/app-winui/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppName
source: Folia
zh_cn: 折笺

# AppDescription
source: A native, self-rendered Markdown editor for Windows.
zh_cn: 面向 Windows 的原生自绘 Markdown 编辑器。

# WindowTitleDocument
source: Folia — {0}
zh_cn: 折笺 — {0}

# WindowTitleSettings
source: Folia — Settings
zh_cn: 折笺 — 设置

# UntitledMarkdown
source: Untitled.md
zh_cn: 未命名.md

source: Untitled.pdf
zh_cn: 未命名.pdf

source: Outline
zh_cn: 目录

source: Sidebar
zh_cn: 侧边栏

source: Toggle outline
zh_cn: 展开或收起目录

source: Open
zh_cn: 打开

# OpenTooltip
source: Open a Markdown document
zh_cn: 打开 Markdown 文档

source: Save
zh_cn: 保存

# SaveTooltip
source: Save the current document
zh_cn: 保存当前文档

# PdfTooltip
source: Export with Windows PDF printing
zh_cn: 使用 Windows PDF 打印导出

source: Bold
zh_cn: 粗体

source: Italic
zh_cn: 斜体

source: Strike
zh_cn: 删除线

source: Strikethrough
zh_cn: 删除线

source: Inline Code
zh_cn: 行内代码

source: Blocks
zh_cn: 块

source: Block structure
zh_cn: 块结构

source: Heading
zh_cn: 标题

source: Heading 1
zh_cn: 一级标题

source: Heading 2
zh_cn: 二级标题

source: Quote
zh_cn: 引用

source: List
zh_cn: 列表

source: Bulleted list
zh_cn: 无序列表

source: Numbered list
zh_cn: 有序列表

source: Task list
zh_cn: 任务列表

source: Code block
zh_cn: 代码块

source: Math block
zh_cn: 数学块

source: Callout
zh_cn: 提示块

source: Note
zh_cn: 注释

source: Tip
zh_cn: 提示

source: Warning
zh_cn: 警告

source: Insert
zh_cn: 插入

source: Insert content
zh_cn: 插入内容

source: Table
zh_cn: 表格

source: Inline math
zh_cn: 行内公式

source: Link
zh_cn: 链接

source: Image
zh_cn: 图片

source: Footnote
zh_cn: 脚注

source: Table of contents
zh_cn: 目录块

source: Settings
zh_cn: 设置

source: Cut
zh_cn: 剪切

source: Copy
zh_cn: 复制

source: Paste
zh_cn: 粘贴

source: Select All
zh_cn: 全选

source: Ready
zh_cn: 就绪

source: Cancel operation
zh_cn: 取消操作

source: Source mode
zh_cn: 源码模式

source: Rendered mode
zh_cn: 渲染模式

# CharacterCount
source: {0} characters
zh_cn: {0} 个字符

# Revision
source: Revision {0}
zh_cn: 修订 {0}

source: Empty footnote definition.
zh_cn: 脚注定义为空。

# ReferenceHasNoDefinition
source: This reference has no definition.
zh_cn: 此引用没有对应的脚注定义。

# ReturnToFirstReference
source: Return to the first reference.
zh_cn: 返回第一个引用。

# DefinitionHasNoReference
source: This definition has no reference.
zh_cn: 此脚注定义没有对应的引用。

source: Go to definition
zh_cn: 转到脚注定义

source: Back to reference
zh_cn: 返回引用

source: Create definition
zh_cn: 创建脚注定义

# ResizeFailed
source: Resize failed: {0}
zh_cn: 调整大小失败：{0}

# RenderFailed
source: Render failed: {0}
zh_cn: 渲染失败：{0}

source: formula
zh_cn: 公式

# EmptyDocumentHint
source: Open a Markdown file or start editing.
zh_cn: 打开 Markdown 文件或直接开始编辑。

# StatusCancellingPdf
source: Cancelling PDF export…
zh_cn: 正在取消 PDF 导出…

# StatusPdfCancelled
source: PDF export cancelled
zh_cn: 已取消 PDF 导出

# StatusCopiedSelection
source: Copied selection
zh_cn: 已复制所选内容

# StatusOpenCancelled
source: Open cancelled
zh_cn: 已取消打开

# StatusReadingFile
source: Reading {0}…
zh_cn: 正在读取 {0}…

# StatusParsingFile
source: Parsing {0}…
zh_cn: 正在解析 {0}…

# StatusOpenedFile
source: Opened {0}
zh_cn: 已打开 {0}

# StatusOpenFailed
source: Open failed: {0}
zh_cn: 打开失败：{0}

# StatusSavedFile
source: Saved {0}
zh_cn: 已保存 {0}

# StatusSaveFailed
source: Save failed: {0}
zh_cn: 保存失败：{0}

# MarkdownFileType
source: Markdown
zh_cn: Markdown 文档

# TextFileType
source: Text
zh_cn: 文本文件

# StatusSaveCancelled
source: Save cancelled
zh_cn: 已取消保存

# PdfFileType
source: PDF document
zh_cn: PDF 文档

# StatusPreparingPdf
source: Preparing PDF…
zh_cn: 正在准备 PDF…

# StatusExportingPdfPage
source: Exporting PDF page {0} of {1}…
zh_cn: 正在导出 PDF，第 {0}/{1} 页…

# StatusPreparingPdfAssets
source: Preparing PDF assets…
zh_cn: 正在准备 PDF 资源…

# StatusExportedPdf
source: Exported PDF: {0}
zh_cn: PDF 已导出至：{0}

# StatusPdfFailed
source: PDF export failed: {0}
zh_cn: PDF 导出失败：{0}

# StatusImageInsertFailed
source: Image insert failed: {0}
zh_cn: 插入图片失败：{0}

# StatusOpenLinkFailed
source: Open link failed: {0}
zh_cn: 打开链接失败：{0}

# StatusPasteFailed
source: Paste failed: {0}
zh_cn: 粘贴失败：{0}

source: General
zh_cn: 常规

source: Themes
zh_cn: 主题

source: Licenses
zh_cn: 许可证

source: About
zh_cn: 关于

# GeneralDescription
source: Control optional rendering services and editor behavior.
zh_cn: 管理可选渲染服务和编辑器行为。

# RenderMath
source: Render mathematical formulas
zh_cn: 渲染数学公式

# MathJaxOn
source: MathJax service on
zh_cn: 启用 MathJax 服务

source: Show Markdown source
zh_cn: 显示 Markdown 源码

# MathServiceDescription
source: When disabled, Folia does not start the QuickJS MathJax worker. Disabling it also interrupts active work and releases the JavaScript runtime.
zh_cn: 关闭后，折笺不会启动 QuickJS MathJax 工作线程；正在进行的任务也会停止，并释放 JavaScript 运行时。

source: Changes apply immediately
zh_cn: 更改立即生效

# MathChangesDescription
source: Existing formulas switch between rendered output and Markdown source. The choice is saved automatically.
zh_cn: 现有公式会在渲染结果和 Markdown 源码之间切换，选项会自动保存。

source: Language
zh_cn: 语言

source: Application language
zh_cn: 应用语言

# FollowWindowsLanguage
source: Follow Windows
zh_cn: 跟随 Windows

# SimplifiedChineseLanguage
source: Simplified Chinese
zh_cn: 简体中文

# LanguageRestartDescription
source: The selected language is used the next time Folia starts.
zh_cn: 折笺将在下次启动时使用所选语言。

# LanguageSavedRestart
source: Language saved. Restart Folia to apply it.
zh_cn: 语言设置已保存。重启折笺后生效。

# ThemesDescription
source: Choose a built-in theme or import a complete JSON profile. Selection only changes the preview until Apply.
zh_cn: 选择内置主题或导入完整的 JSON 配置。选择只会更新预览，点击“应用”后才会生效。

# LicensesDescription
source: Review the Folia license and notices for bundled third-party software.
zh_cn: 查看折笺的许可证及随应用分发的第三方软件许可声明。

# LicenseDocument
source: Document
zh_cn: 许可文档

# FoliaLicense
source: Folia — MIT License
zh_cn: 折笺 — MIT 许可证

source: Third-party notices
zh_cn: 第三方许可声明

# UnableLoadLicense
source: Unable to load the license document: {0}
zh_cn: 无法加载许可文档：{0}

source: Apply
zh_cn: 应用

source: Import…
zh_cn: 导入…

source: Remove
zh_cn: 移除

# AboutApp
source: About Folia
zh_cn: 关于折笺

# Version
source: Version {0}
zh_cn: 版本 {0}

# LicenseSummary
source: MIT License · Third-party notices are included with every build
zh_cn: MIT 许可证 · 每份构建均附带完整第三方许可清单

source: Built for Windows
zh_cn: 为 Windows 而生

# TechnologyDescription
source: WinUI 3 shell · C++23 document engine · DirectWrite/Direct2D rendering · QuickJS MathJax integration
zh_cn: WinUI 3 外壳 · C++23 文档引擎 · DirectWrite/Direct2D 渲染 · QuickJS MathJax 集成

# FollowWindowsTheme
source: Follow Windows
zh_cn: 跟随 Windows

# AutomaticThemeDescription
source: Automatic light, dark, and high contrast
zh_cn: 自动切换浅色、深色和高对比度

source: Built-in
zh_cn: 内置

source: Custom
zh_cn: 自定义

# ThemePreviewBody
source: Markdown can be calm, readable, and expressive.
zh_cn: Markdown 可以安静、清晰而富有表现力。

# ThemePreviewQuote
source: A theme preview uses the profile's real fonts and colors.
zh_cn: 主题预览会使用配置中的真实字体和颜色。

source: Light profile
zh_cn: 浅色配置

source: High contrast profile
zh_cn: 高对比度配置

source: Dark profile
zh_cn: 深色配置

# ThemeImported
source: Theme imported. Select Apply to use it.
zh_cn: 主题已导入，点击“应用”后使用。

# ThemeImportFailed
source: Unable to import theme: {0}
zh_cn: 无法导入主题：{0}

# ApplyThemeBeforeRemove
source: Apply another theme before removing the active theme.
zh_cn: 请先应用其他主题，再移除当前主题。

source: Custom theme removed
zh_cn: 自定义主题已移除

source: Theme applied
zh_cn: 主题已应用

# SettingsFallback
source: Settings fallback: {0}
zh_cn: 设置已回退：{0}

# UnableSaveSettings
source: Unable to save settings: {0}
zh_cn: 无法保存设置：{0}

# IgnoredDuplicateTheme
source: Ignored duplicate theme id: {0}
zh_cn: 已忽略重复的主题 ID：{0}

# UnableEnumerateThemeDirectory
source: Unable to enumerate theme directory: {0}
zh_cn: 无法枚举主题目录：{0}

# SelectedThemeUnavailable
source: Selected theme is unavailable; using the Windows theme.
zh_cn: 所选主题不可用，已改为跟随 Windows 主题。

# BuiltInThemeIdConflict
source: A built-in theme already uses this id.
zh_cn: 已有内置主题使用此 ID。

# ThemeNotFound
source: Theme was not found.
zh_cn: 找不到该主题。

# BuiltInThemeCannotRemove
source: Built-in themes cannot be removed.
zh_cn: 不能移除内置主题。

# ThemeOutsideManagedDirectory
source: Theme is outside the managed theme directory.
zh_cn: 主题不在受管理的主题目录中。

# UnableImportTheme
source: Unable to import theme: {0}
zh_cn: 无法导入主题：{0}

# UnableRemoveTheme
source: Unable to remove theme: {0}
zh_cn: 无法移除主题：{0}

# UnableLoadTheme
source: Unable to load theme {0}: {1}
zh_cn: 无法加载主题 {0}：{1}

# ThemeVariantMismatch
source: Built-in theme variant does not match its file.
zh_cn: 内置主题的变体与文件不匹配。

# ThemeFallback
source: Theme fallback: {0}
zh_cn: 主题已回退：{0}

# PdfExportJobName
source: Folia PDF export
zh_cn: 折笺 PDF 导出

source: Find
zh_cn: 查找

source: Replace
zh_cn: 替换

source: Replace all
zh_cn: 全部替换

source: Regular expression
zh_cn: 正则表达式

source: Match case
zh_cn: 区分大小写

source: Previous match
zh_cn: 上一个匹配

source: Next match
zh_cn: 下一个匹配

source: Close
zh_cn: 关闭

# FindNoResults
source: No results
zh_cn: 无匹配结果

# FindResultCount
source: {0} of {1}
zh_cn: 第 {0} 项，共 {1} 项

# FindError
source: Invalid pattern: {0}
zh_cn: 表达式无效：{0}
